'use strict'

const obj = {
  flowerName : ["ダリア","キンモクセイ","ヒマワリ","シロツメクサ","ワスレナグサ","アジサイ","アネモネ"],
  flowerPhoto : ["daria.jpg","kinmokusei.jpg","himawari.jpg","shirotumekusa.jpg","wasurenagusa.jpg","ajisai.jpg","anemone.jpg"],
  flowerText : ["花言葉：華麗、優雅、気品、感謝、威厳","花言葉：謙虚、気高い人","花言葉：あなただけを見つめる、崇拝、憧れ","花言葉：私を思って、幸運、約束、復讐","花言葉：私を忘れないで、真実の愛、真実の友情","花言葉：神秘的、団らん、無常、辛抱強い愛","花言葉：はかない恋、あなたを愛します、あなたを信じて待つ"],
  flowerComment : [
    "花びら1枚1枚を見ると包み込んでくれる優しさを感じるのに\n全ての花びらが集まると強く美しすぎる花だなぁと思います。\nダリアの花のような女性に憧れます。",
    "木にいる時は小さい花が集まり強い香りで魅了する高嶺の花のように感じるのに\n散った後の花はすごくかわいらしく愛嬌のある花だなぁと思います。\n金木犀の香りは好き嫌い分かれますが、私は大好きです。",
    "大きい花だけど威圧感はなく、温かく見守ってくれている優しさを感じる花だなぁと思います。\nまた、前だけ見て進みなさいと励まし背中を押してくれるような花でもあるなぁと思います。\n一番好きな花です。好きな人にもらいたい！！",
    "色んな意味で幸せな気持ちにさせてくれる花だなぁと思います。\n私は小学生の時はよく花では花冠を作ったり、葉では四つ葉のクローバーを探して\n楽しく遊んでいたのでそんなイメージがついてます。",
    "私は尾崎豊さんの歌でこの花を知ったんですが、\n愛を歌っているのになぜかすごく切ない気持ちになる歌で\nこの花にもなんかそんなイメージがあります。",
    "気持ちを落ち着かせてくれる花だなぁと思います。\n雨は憂鬱なんですが、雨上がりのアジサイは特に好きで\nいつもより綺麗で輝きを増しているように感じます。",
    "見た目はすごく美しく気品の高い花なのに\n愛を追いかけてるような感じがする花だなぁと思います。\nでもその愛は表では出さないみたいなギャップが感じて好きです。"],
}

